---
kind: method
id: M:Autodesk.Revit.DB.ParameterValue.Dispose
source: html/8df3f1e5-ef6e-810e-61d2-bc383fc7fb69.htm
---
# Autodesk.Revit.DB.ParameterValue.Dispose Method

Releases all resources used by the ParameterValue

## Syntax (C#)
```csharp
public void Dispose()
```